# pandas

pandas is the primary module of interest for this course, as it provides data processing and analysis functionality for data in many forms. In addition, pandas offers two additional data structures, the **Series** and the **DataFrame**, that leverage much of the most useful functionality from lists, dictionaries, and n-dimensional arrays.

Similar to our NumPy class, we will focus today on:

* Creating Series and DataFrame objects
* Getting familiar with Series and DataFrame methods
    - Indexing, slicing, and filtering
    - Mathematical operations
    - Sorting and ranking
    - Function application and mapping

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Creating Series and DataFrame objects

Similar to NumPy, most often, we will import our data into **Series** and **DataFrame** objects from another source; but for now, we will create them manually by casting from other appropriate data types.

### Series

**Series** objects are very similar to **ndarrays**...

* Indexing, slicing, filtering work in a similar way
* Easy and fast computation
* Concatenation

...with some additional features:

* An associated array of data labels, called an **index** object -- Index elements of a Series via positional indexing (as in an array) or via an index (similar to a dictionary key)
* Database-style merging

In [4]:
# Cast from another sequence object - list, tuple, or array
ser = Series([1,-2,3,-4])
ser

0    1
1   -2
2    3
3   -4
dtype: int64

In [6]:
# Basic indexing
ser[1]

-2

In [5]:
# Specify indices
ser = Series([1,-2,3,-4], index=['a','b','c','d'])
ser

a    1
b   -2
c    3
d   -4
dtype: int64

In [6]:
# Basic indexing - By index or position
print(ser.c, ser['c'], ser[2])

3 3 3

In [4]:
# Create from dictionary
D = {key:val for key,val in zip('abcd', [1,-2,3,-4])}
ser = Series(D)
print(ser)
D

a    1
b   -2
c    3
d   -4
dtype: int64

{'a': 1, 'b': -2, 'c': 3, 'd': -4}

In [6]:
# Drop values
ser.drop('c')

a    1
b   -2
d   -4
dtype: int64

In [9]:
# Print Series
ser

a    1
b   -2
c    3
d   -4
dtype: int64

In [10]:
# Deleting values
del ser['c']
ser

a    1
b   -2
d   -4
dtype: int64

Series objects have attributes that are similar dictionaries:

In [11]:
# Index object - similar to dictionary keys, returns an index array
ser.index

Index(['a', 'b', 'd'], dtype='object')

In [12]:
# Values - similar to dictionary values, returns an array
ser.values

array([ 1, -2, -4])

In [ ]:
# DataFrame index
df.index
# DataFrame columns
df.columns
# DataFrame values
df.values

# Index object - similar to dictionary keys, returns an index array
ser.index
# Values - similar to dictionary values, returns an array
ser.values

In [13]:
# Check for membership
print('e' in ser.index)
print(-2 in ser.values)

False
True

### DataFrames

**DataFrames**, in their most basic form, are 2-dimensional data structures (rows and columns), and are similar in structure to a dictionary of Series objects (i.e., each Series is accessible via a column key). DataFrames can also represent higher dimensional data by leveraging *hierarchical indexing*.

Aside from loading data from a file directly into a DataFrame (later), the primary methods for creating a DataFrame are:

* From a dictionary of equal-length sequences or (any-length) Series objects
* From a 2-d array or sequence of equal-length sequences

In [14]:
# Dictionary of equal-length sequences
df = DataFrame({'a': [1,2,3], 'b': (4,5,6), 'c': np.array([7,8,9])}, index=[1,2,3])
df

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [21]:
l = [1,2,3,4]
l.append(5)

In [22]:
l

[1, 2, 3, 4, 5]

In [9]:
ser = ser.append(Series({'e':5})) ##impppppppppp/.
ser.append(Series({'g':8}))

a    1
b   -2
c    3
d   -4
e    5
e    5
g    8
dtype: int64

In [10]:
ser

a    1
b   -2
c    3
d   -4
e    5
e    5
dtype: int64

In [52]:
# Dictionary of Series objects
df = DataFrame({'Original': ser.append(Series({'e':5})), 'Negated': -ser}) #impppppp
df

   Original  Negated
a         1     -1.0
b        -2      2.0
d        -4      4.0
e         5      NaN

In [12]:
# 2-d array
df = DataFrame(np.random.rand(3,3), columns=['a','b','c'], index=[1,2,3])
df

          a         b         c
1  0.292939  0.867799  0.467394
2  0.564532  0.753769  0.416341
3  0.030206  0.521404  0.910748

DataFrames have similar attributes as Series objects:

In [54]:
# DataFrame index
df.index

Int64Index([1, 2, 3], dtype='int64')

In [55]:
# DataFrame columns
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [56]:
# DataFrame values
df.values

array([[0.0482438 , 0.90804325, 0.1886421 ],
       [0.11874233, 0.42266331, 0.0573218 ],
       [0.59746956, 0.74674463, 0.11358427]])

Indexing DataFrames columns follows the general syntax:

```
df[column(s)]
```

In addition, there are .loc and .iloc methods that allow you to access and update more specific information contained within the DataFrame. The .loc method accesses the [row(s), column(s)] data by index and column name. The .iloc method accesses the [row(s), column(s)] data by positional row and column indices.

In [57]:
# Basic column indexing
df['b'] # or df.b, only works if column name does not match a DataFrame method or have spaces

1    0.908043
2    0.422663
3    0.746745
Name: b, dtype: float64

In [23]:
# Multiple columns
df[['a','c']]

          a         c
1  0.292939  0.467394
2  0.564532  0.416341
3  0.030206  0.910748

In [19]:
# Columns and rows
print(df[['a','b']].loc[[1,2]])
print(df.loc[[1,2],['a','b']])

          a         b
1  0.292939  0.867799
2  0.564532  0.753769
          a         b
1  0.292939  0.867799
2  0.564532  0.753769

In [60]:
# Updating values using .loc
df.loc[1,'a'] = np.random.rand()
df

          a         b         c
1  0.454624  0.908043  0.188642
2  0.118742  0.422663  0.057322
3  0.597470  0.746745  0.113584

In [61]:
# .iloc method
df.iloc[:2, 2:]

          c
1  0.188642
2  0.057322

In [62]:
# Creating new columns - New value(s) will be broadcast (if applicable)
df['d'] = np.random.rand(3)
df

          a         b         c         d
1  0.454624  0.908043  0.188642  0.429254
2  0.118742  0.422663  0.057322  0.514427
3  0.597470  0.746745  0.113584  0.389667

In [63]:
# Creating new columns - Series
df['e'] = Series(np.random.rand(3), index=[1,2,4])
df

          a         b         c         d         e
1  0.454624  0.908043  0.188642  0.429254  0.350929
2  0.118742  0.422663  0.057322  0.514427  0.790395
3  0.597470  0.746745  0.113584  0.389667       NaN

In [64]:
# Dropping rows
df.drop(2, axis=0)

          a         b         c         d         e
1  0.454624  0.908043  0.188642  0.429254  0.350929
3  0.597470  0.746745  0.113584  0.389667       NaN

In [65]:
# Dropping columns
df.drop('b', axis=1)

          a         c         d         e
1  0.454624  0.188642  0.429254  0.350929
2  0.118742  0.057322  0.514427  0.790395
3  0.597470  0.113584  0.389667       NaN

In [66]:
# Display df
df

          a         b         c         d         e
1  0.454624  0.908043  0.188642  0.429254  0.350929
2  0.118742  0.422663  0.057322  0.514427  0.790395
3  0.597470  0.746745  0.113584  0.389667       NaN

In [67]:
# Deleting columns
del df['e']
df

          a         b         c         d
1  0.454624  0.908043  0.188642  0.429254
2  0.118742  0.422663  0.057322  0.514427
3  0.597470  0.746745  0.113584  0.389667

### Filtering with Series and DataFrames

Similar to arrays, one of the primary techniques for filtering your data involves boolean arrays, which you can store as an array (to use multiple times) or apply inline (to use once). The key is that your boolean array must broadcast appropriately to the filtered object.

You can apply a filter to a Series, DataFrame column (which is also a Series), or a DataFrame, given the shape of the boolean array matches appropriately.

Comparisons for generating the boolean arrays can include:

* <, >, <=, >=, ==, !=
* in (membership) - also combine with not (not in)
* is (identity) - also combine with not (is not)
* .any(*axis*), .all(*axis*) where *axis* allows you to specify whether to aggregate across a row (1) or down a column (0)
* .isnull/.isna, .notnull/.notna methods (next)
* Vectorized string .is methods (later)
* Vectorized function applications (later)
* And more!

You can generate more complex comparisons using logical and, or, xor, or not operations:

* and, & (scalar) and np.logical_and (array)
* or, | (scalar) and np.logical_or (array)
* ^ (xor, scalar) and np.logical_xor (array)
* not (scalar), and np.logical_not (array)

You can also combine filtering with assignment, using the .loc method. Remember, the assigned object must broadcast appropriately to the filtered data structure. For example, a scalar will be broadcast to all values, a list or array dimensions must match appropriately, and a Series object must have the same indices (otherwise, you will get NaN).

In [68]:
df

          a         b         c         d
1  0.454624  0.908043  0.188642  0.429254
2  0.118742  0.422663  0.057322  0.514427
3  0.597470  0.746745  0.113584  0.389667

In [69]:
# Column filter
df.loc[:, np.array([True,False,True,True])]

          a         c         d
1  0.454624  0.188642  0.429254
2  0.118742  0.057322  0.514427
3  0.597470  0.113584  0.389667

In [25]:
# Identify values greater than 0.5
mask = df > 0.5
mask

       a     b      c
1  False  True  False
2   True  True  False
3  False  True   True

In [26]:
# Apply mask to DataFrame
df[mask]

          a         b         c
1       NaN  0.867799       NaN
2  0.564532  0.753769       NaN
3       NaN  0.521404  0.910748

In [29]:
# Apply any or all method to mask - down each column (axis=0), across each row (axis=1)
amask = mask.any(axis=1)
amask

1    True
2    True
3    True
dtype: bool

In [30]:
# Apply amask to DataFrame - must match dimensions
df.loc[amask, :]

          a         b         c
1  0.292939  0.867799  0.467394
2  0.564532  0.753769  0.416341
3  0.030206  0.521404  0.910748

In [74]:
# Apply filter inline
df[df > 0.5]

         a         b   c         d
1      NaN  0.908043 NaN       NaN
2      NaN       NaN NaN  0.514427
3  0.59747  0.746745 NaN       NaN

In [75]:
# Apply filter based on column values
df['color'] = 'blue', 'green', 'blue' ## this is a tuple, without the braces
df[df['color'] == 'blue']

          a         b         c         d color
1  0.454624  0.908043  0.188642  0.429254  blue
3  0.597470  0.746745  0.113584  0.389667  blue

In [76]:
# Apply filter to specific column
print(df['b'][df['color'] == 'green'])
print(df.loc[df['color'] == 'green', 'b'])

2    0.422663
Name: b, dtype: float64
2    0.422663
Name: b, dtype: float64

In [77]:
# Combine filtering with assignment
df.loc[df['color'] == 'green', 'b'] = 0
df

          a         b         c         d  color
1  0.454624  0.908043  0.188642  0.429254   blue
2  0.118742  0.000000  0.057322  0.514427  green
3  0.597470  0.746745  0.113584  0.389667   blue

### Descriptive Statistics

Similar to arrays, there are many built-in functions and methods for computing descriptive statistics on Series and DataFrame objects:

* .count
* .describe
* .min, .max
* .argmin, .argmax
* .idxmin, .idxmax
* .quantile
* .sum
* .mean
* .median
* .mad (mean absolute deviation)
* .prod
* .var
* .std
* .skew
* .kurt
* .cumsum
* .cummin, .cummax
* .cumprod
* .diff
* .pct_change

Some of these functions are aggregation functions and some are non-aggregation functions. In addition, many functions have an *axis* input that allows you to compute the function down each column (*axis* = 0) or across each row (*axis* = 1).

In addition, there are correlation and covariance methods:

* ser.corr or df.corr
* ser.cov or df.cov
* df.corrwith

And summary and comparison functions for categorical data:

* .unique (unique values)
* .value_counts (frequency summary)
* .isin (membership)

In [78]:
# Create series object
ser = Series(np.random.randn(100))

In [79]:
# .describe method
ser.describe()

count    100.000000
mean      -0.007720
std        0.958872
min       -3.019557
25%       -0.606350
50%        0.059174
75%        0.697913
max        2.186365
dtype: float64

In [80]:
# Create DataFrame object
df = DataFrame(np.random.randn(100,3))

In [81]:
# Compute summary statistic across row (axis=1) or column (axis=0)
df.sum(axis=1) #.sum() for total sum of whole df

0     0.861404
1     3.365723
2    -0.022520
3    -0.700292
4    -1.592630
5    -0.332472
6     0.063341
7     1.258520
8     0.894656
9     2.698037
10    0.458910
11    0.151498
12    0.443251
13    3.032854
14    4.209545
15    0.725796
16    1.283802
17    4.664193
18   -0.665434
19   -0.988375
20   -0.850498
21    1.626609
22    1.151970
23   -3.679816
24   -0.649399
25    1.162879
26    1.154891
27   -4.006289
28   -1.290207
29    2.231256
        ...
70    2.506673
71   -0.572088
72    1.527280
73    0.703369
74   -1.729929
75   -1.734377
76   -1.430786
77   -0.983877
78   -2.712031
79    0.879250
80   -0.392004
81   -1.354964
82   -2.449775
83    0.456606
84    1.865749
85    0.054530
86    2.017593
87    2.073133
88   -1.804068
89    0.710676
90    1.182283
91   -2.887203
92   -2.124926
93   -2.326829
94   -0.898349
95   -1.063465
96    0.208546
97   -0.684312
98    0.691494
99    0.426286
Length: 100, dtype: float64

In [82]:
# Correlation matrix
df.corr()

          0         1         2
0  1.000000 -0.105214  0.093257
1 -0.105214  1.000000  0.073905
2  0.093257  0.073905  1.000000

In [83]:
# Create categorical series
cser = Series(['green'] * 20 + ['red'] * 25 + ['blue'] * 10)
cser.head()

0    green
1    green
2    green
3    green
4    green
dtype: object

In [84]:
# Unique values
cser.unique()

array(['green', 'red', 'blue'], dtype=object)

In [85]:
# Value counts
cser.value_counts()

red      25
green    20
blue     10
dtype: int64

In [86]:
# Membership
cser.isin(['green','red']).sum()

45

### Arithmetic Operations and Data Alignment

Similar to arrays, arithmetic operations (and comparisons) involving Series and DataFrame objects are flexible. The interpreter will attempt to broadcast scalars and sequences to the appropriate Series and DataFrame dimensions (if possible).

However, for arithmetic operations (and comparisons) strictly involving Series and/or DataFrame objects, the interpreter will match the indices of the objects and perform the operation between matching elements (i.e., those with the same index *and* column). This process is called *data alignment* and is an important aspect of working with pandas data structures. Operations involving entries (indices) that exist in one object and not in the other will result in NaN. To get around this issue, you can make sure beforehand that the indices match, or you perform the operation by casting to an array.

In [116]:
# Create Series objects
ser1 = Series([1,2,3])
ser2 = Series([1,2,3], index=[1,2,3])
DataFrame({'1': ser1, '2': ser2})

     1    2
0  1.0  NaN
1  2.0  1.0
2  3.0  2.0
3  NaN  3.0

In [117]:
# Arithmetic between Series and scalar
ser1 + 5

0    6
1    7
2    8
dtype: int64

In [118]:
# Arithmetic between Series and sequence
ser1 + np.array([10,20,30]) # works for list and tuples too

0    11
1    22
2    33
dtype: int64

In [119]:
# Arithmetic between two Series objects
ser1 + ser2

0    NaN
1    3.0
2    5.0
3    NaN
dtype: float64

In [120]:
# Arithmetic methods - .add, .sub, .div, .floordiv, .mul, .pow
ser1.add(ser2, fill_value=0)

0    1.0
1    3.0
2    5.0
3    3.0
dtype: float64

In [121]:
# Create two DataFrames
df1 = DataFrame(np.random.rand(3,3))
df1

          0         1         2
0  0.695075  0.558690  0.333742
1  0.262180  0.948660  0.555225
2  0.057718  0.393044  0.307741

In [122]:
df2 = DataFrame(np.random.rand(3,3), index=[1,2,3], columns=[1,2,3])
df2

          1         2         3
1  0.242129  0.203114  0.438357
2  0.746013  0.011734  0.102863
3  0.126070  0.991838  0.455215

In [123]:
# Perform operation between DataFrames
df1 + df2

    0         1         2   3
0 NaN       NaN       NaN NaN
1 NaN  1.190789  0.758338 NaN
2 NaN  1.139057  0.319475 NaN
3 NaN       NaN       NaN NaN

In [124]:
# Perform operation between DataFrame values
DataFrame(df1.values + df2.values)

          0         1         2
0  0.937204  0.761803  0.772098
1  1.008192  0.960394  0.658088
2  0.183788  1.384883  0.762956

### Function Application and Mapping

Similar to arrays, Series and DataFrames support fast computation and comparison operations. NumPy universal functions (e.g., np.abs, np.square, np.log, np.exp, etc.) work as expected (for both Series and DataFrame objects with numerical data).

However, there are many operations that we would like to apply that do not have built in functions or methods. Here is where our lambda functions come in handy, but we can use fully defined functions as well. There are three primary methods for applying custom functions to Series or DataFrame objects:

* Series .map method - Applies function to each element in Series
* DataFrame .apply method - Applies function column- or row-wise
* DataFrame .applymap method - Applies function to each element in DataFrame

In [125]:
# Apply NumPy universal function
df = DataFrame(np.random.rand(3,5))
print(df)
np.exp(df)

          0         1         2         3         4
0  0.894147  0.681645  0.962697  0.594545  0.502683
1  0.872003  0.817253  0.702010  0.944563  0.466289
2  0.990024  0.898369  0.403156  0.015550  0.747846

          0         1         2         3         4
0  2.445249  1.977127  2.618750  1.812205  1.653151
1  2.391696  2.264270  2.017804  2.571691  1.594068
2  2.691299  2.455595  1.496541  1.015671  2.112446

In [126]:
# Series map method - Numerical computation
ser = Series(np.random.rand(10))
print(ser)
ser.map(lambda x: x ** 2)

0    0.928004
1    0.972243
2    0.155385
3    0.387109
4    0.981395
5    0.060695
6    0.840204
7    0.889105
8    0.512149
9    0.425067
dtype: float64

0    0.861192
1    0.945256
2    0.024144
3    0.149853
4    0.963136
5    0.003684
6    0.705943
7    0.790508
8    0.262297
9    0.180682
dtype: float64

In [32]:
print([map(lambda s: len(s.split()), Series({1: 'The Green Mile', 2: 'Black Panther', 3: 'The Bourne Identity'}).map(lambda s: len(s.split())))])



print([map(lambda s: len(s), [2,3,4])])

[<map object at 0x1103e0750>]
[<map object at 0x1103e0550>]

In [127]:
# Series .map method - String operation
Series({1: 'The Green Mile', 2: 'Black Panther', 3: 'The Bourne Identity'}).map(lambda s: len(s.split()))

1    3
2    2
3    3
dtype: int64

In [129]:
# DataFrame .apply method - down each column (axis=0), across each row (axis=1)
print(df)
print(df.apply(lambda arr: arr / arr.sum(), axis=0))

          0         1         2         3         4
0  0.894147  0.681645  0.962697  0.594545  0.502683
1  0.872003  0.817253  0.702010  0.944563  0.466289
2  0.990024  0.898369  0.403156  0.015550  0.747846
          0         1         2         3         4
0  0.324416  0.284343  0.465552  0.382428  0.292799
1  0.316382  0.340910  0.339486  0.607570  0.271601
2  0.359202  0.374747  0.194963  0.010002  0.435600

In [132]:
# DataFrame .applymap method
df.applymap(lambda x: x / df.sum().sum())

          0         1         2         3         4
0  0.085215  0.064963  0.091749  0.056662  0.047908
1  0.083105  0.077887  0.066904  0.090020  0.044439
2  0.094353  0.085618  0.038422  0.001482  0.071272

### Sorting and Ranking

Oftentimes, you will want to sort your Series or DataFrame objects according to some of the contained data. The primary method for sorting is:
```
ser.sort_values(ascending=True/False)
df.sort_values(by=column(s), ascending=True/False)
```

To re-sort your data structure into its original form, use the sort.index method.

Alternatively, you can determine the rank of each value using the .rank method.

In [ ]:
# Sort series
ser.sort_values(ascending=True)

In [ ]:
# Sort DataFrame
df.sort_values(by=1, ascending=False)

In [ ]:
# Rank method - by column (axis=0), by row (axis=1)
df.rank(axis=0, method='average', ascending=True) # method = 'average', 'min', 'max', 'first', 'dense'